---
---

<center><h1>üìç üìç Assignment: Sorting and Aggregating Data üìç üìç</h1></center>

---

#### `READ THE DATASET`

---

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('dataset/time_series.csv', parse_dates = ['Datetime'])

In [3]:
data.head()

   ID            Datetime  Count
0   0 2012-08-25 00:00:00      8
1   1 2012-08-25 01:00:00      2
2   2 2012-08-25 02:00:00      6
3   3 2012-08-25 03:00:00      2
4   4 2012-08-25 04:00:00      2

In [4]:
data.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

#### `Convert the Datetime column to pandas datetime object`

---

In [ ]:
# WRITE YOUR CODE HERE

# While reading the csv file,we have a parameter as 'parse_dates' in which I have mentioned the column name which needs to be 
# converted in datetime.
# If not, we can use explict method as: -
data.Datetime = pd.to_datetime(data.Datetime)

---

####  `Create the following features using the Datetime feature`

- day of month
- month
- day of year
- hour

---

In [5]:
# WRITE YOUR CODE HERE

data['Day_of_Month'] = data.Datetime.dt.day_name()
data['Month_Name'] = data.Datetime.dt.month_name()
data['Day_of_Year'] = data.Datetime.dt.dayofyear
data['Hour'] = data.Datetime.dt.hour

In [6]:
data.head()

   ID            Datetime  Count Day_of_Month Month_Name  Day_of_Year  Hour
0   0 2012-08-25 00:00:00      8     Saturday     August          238     0
1   1 2012-08-25 01:00:00      2     Saturday     August          238     1
2   2 2012-08-25 02:00:00      6     Saturday     August          238     2
3   3 2012-08-25 03:00:00      2     Saturday     August          238     3
4   4 2012-08-25 04:00:00      2     Saturday     August          238     4

---

#### `Consider the following dataframe`

---

In [7]:
sample_df = pd.DataFrame({
    'id'   :  [1, 2, 3, 4, 5],
    'name' :  [ 'Akash', 'Akansha', 'Naman', 'Pulkit', 'Anand'],
    'marks':  [ 22, 23, 43, 41, 12]
})
sample_df

   id     name  marks
0   1    Akash     22
1   2  Akansha     23
2   3    Naman     43
3   4   Pulkit     41
4   5    Anand     12

#### Sort the  dataframe by `marks` column in descending order

---

In [8]:
# WRITE YOUR CODE HERE
sample_df.sort_values(by=['marks'], ascending= False, inplace=True)

In [9]:
sample_df.reset_index(inplace = True, drop = True)
sample_df

   id     name  marks
0   3    Naman     43
1   4   Pulkit     41
2   2  Akansha     23
3   1    Akash     22
4   5    Anand     12

#### Consider another dataframe city
---

In [10]:
city = pd.DataFrame({
    'name' : ['Akash', 'Akansha', 'Pulkit', 'Anand', 'Naman'],
    'city' : ['Delhi', 'Gurugram', 'Gurugram', 'Delhi', 'Noida']
})
city

      name      city
0    Akash     Delhi
1  Akansha  Gurugram
2   Pulkit  Gurugram
3    Anand     Delhi
4    Naman     Noida

***Use the dataframe `sample_df` and `city` and find out the marks of students who live in Gurugram.***

---

In [11]:
### Write your code here

new_df = sample_df.merge(city, how = 'left', on = 'name')

In [12]:
new_df

   id     name  marks      city
0   3    Naman     43     Noida
1   4   Pulkit     41  Gurugram
2   2  Akansha     23  Gurugram
3   1    Akash     22     Delhi
4   5    Anand     12     Delhi

In [13]:
new_df.loc[new_df['city'] == 'Gurugram']

   id     name  marks      city
1   4   Pulkit     41  Gurugram
2   2  Akansha     23  Gurugram

#### `READ THE BIG MART SALES DATA`

---

In [14]:
big_mart_data = pd.read_csv('dataset/big_mart_sales.csv')

In [15]:
big_mart_data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

#### Find out the number of unique `Item_Type` in each of the `Outlet_Identifier`

---

In [16]:
# WRITE YOUR CODE HERE

new_gb = big_mart_data.groupby(['Outlet_Identifier'])

In [17]:
new_gb.Item_Type.value_counts()

Outlet_Identifier  Item_Type
OUT010             Fruits and Vegetables    79
                   Snack Foods              71
                   Household                67
                   Frozen Foods             54
                   Dairy                    43
                                            ..
OUT049             Breads                   25
                   Others                   17
                   Starchy Foods            17
                   Breakfast                13
                   Seafood                   7
Name: Item_Type, Length: 160, dtype: int64

#### Find out the average `Item_Outlet_Sales` for each category of `Outlet_Size`

---

In [18]:
# WRITE YOUR CODE HERE

new_Outlet_Size = big_mart_data.groupby(['Outlet_Size'])

In [19]:
new_Outlet_Size.Item_Outlet_Sales.mean()

Outlet_Size
High      2298.995256
Medium    2681.603542
Small     1912.149161
Name: Item_Outlet_Sales, dtype: float64

#### Select only the categorical variables from the dataframe and use `get_dummies` function to convert those into the numerical ones. 

---

In [20]:
# WRITE YOUR CODE HERE

big_mart_data = pd.get_dummies(big_mart_data)

In [21]:
big_mart_data.head()

,Item_Weight,Item_Visibility,Item_MRP,Outlet_Establishment_Year,Item_Outlet_Sales,Item_Identifier_DRA12,Item_Identifier_DRA24,Item_Identifier_DRA59,Item_Identifier_DRB01,Item_Identifier_DRB13,...,Outlet_Size_High,Outlet_Size_Medium,Outlet_Size_Small,Outlet_Location_Type_Tier 1,Outlet_Location_Type_Tier 2,Outlet_Location_Type_Tier 3,Outlet_Type_Grocery Store,Outlet_Type_Supermarket Type1,Outlet_Type_Supermarket Type2,Outlet_Type_Supermarket Type3
0,9.30,0.016047,249.8092,1999,3735.1380,0,0,0,0,0,...,0,1,0,1,0,0,0,1,0,0
1,5.92,0.019278,48.2692,2009,443.4228,0,0,0,0,0,...,0,1,0,0,0,1,0,0,1,0
2,17.50,0.016760,141.6180,1999,2097.2700,0,0,0,0,0,...,0,1,0,1,0,0,0,1,0,0
3,19.20,0.000000,182.0950,1998,732.3800,0,0,0,0,0,...,0,0,0,0,0,1,1,0,0,0
4,8.93,0.000000,53.8614,1987,994.7052,0,0,0,0,0,...,1,0,0,0,0,1,0,1,0,0